#include <iostream>
using namespace std;

/*Завдання 1:
Створіть клас Array це клас динамічного масиву чисел з певним функціоналом.Властивостями класа буде вказівник на сам масив(long* arr) та його теперішній розмір(int size).
Клас повинен дозволяти наступний функціонал :
Заповнити масив значеннями(випадковими, з клавіатури замовчуванню(заповнити масив 0)) no
Відображати вміст масиву
Додавати елемент в масив
Видаляти елемент з масива(по значенню або по індексу)
Відсортувати масив(по спаданню / зростанню)
Визначати значення(мінімальне, максимальне ma арифметичне середнє
    Також передбачити набір конструкторів :
Конструктор за замовчуванням, який встановлювтиме початкові значення(заповнити масив 0))
Конструктор, який прийматиме розмір масиву та заповнюватиме нулем всі елементи
Конструктор копіювання, який буде копіювати всі дані об'єкта включаючи масив
Також реалізувати деструктор в класі для уникнення втрати пам'яті. Врахувати можливі помилки (видалення не існуючого елемента, порожній масив і тд.). Успіхів!
Всі методі, які не змінюють оригінал мають бути CONST, create explicit constructor*/

int main()
{
    cout << "Hello World!\n";
}
