
#include <iostream>
using namespace std;
/*Завдання 1. Використовуючи покажчики й оператор
розіменування, визначити найбільше з двох чисел.

Завдання 2. Використовуючи покажчики й оператор розі -
менування, визначити знак числа, введеного з клавіатури.

Завдання 3. Використовуючи покажчики й оператор роз -
іменування, поміняти місцями значення двох змінних.

Завдання 4. Написати примітивний калькулятор, кори -
стуючись тільки покажчиками.

Завдання 5. Використовуючи покажчик на масив цілих
чисел, порахувати суму елементів масиву.Використову -
вати в програмі арифметику покажчиків для просування
по масиву, а також оператор розіменування*/
int* FindMax(int* a, int* b)
{
    if (*a > *b)
    {
        return a;
    }
    return b;
}
void FindSymbol(int* a)
{
    if (*a <0)
    {
        cout << "Symbol of " <<*a << " is " << '-';
    }
    cout << "Symbol of " << *a << " is " << '+';;
}
void swapping(int* a, int* b)
{
    int temp = *a;
    *a = *b;
    *b = temp;
}


int main()
{
    int a = 7; int b = 10; 
    int* pmax = FindMax(&a,&b);
    cout << pmax << endl;
    cout << *pmax << endl;
    cout << "Task2" << endl;
    FindSymbol(&a);
    
    cout << "\nTask3" << endl;
    cout << "Num1 " << a << " " << "Num2 " << b <<endl;
    swapping(&a, &b);
    cout << "Num1 " << a << " " << "Num2 " << b;
}